mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/pwm.c
/*
 * This file is part of the Micro Python project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2016-2021 Damien P. George
 * Copyright (c) 2018 Alan Dragomirecky
 * Copyright (c) 2020 Antoine Aubert
 * Copyright (c) 2021 Ihor Nehrutsa
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdint.h>
#include "py/runtime.h"
#include "py/gc.h"
#include "py/mphal.h"
// #include "inc/tm4c123gh6pm.h"
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_gpio.h"
#include "inc/hw_pwm.h"
// #include "driverlib/sysctl.h"
// #include "driverlib/gpio.h"
// #include "driverlib/pwm.h"
// #include "driverlib/interrupt.h"

#include "pwm.h"
#include "pin.h"

enum {PWM_M0PWM0, PWM_M0PWM1, PWM_M0PWM2, PWM_M0PWM3, PWM_M0PWM4, PWM_M0PWM5, PWM_M0PWM6, PWM_M0PWM7,
        PWM_M1PWM0, PWM_M1PWM1, PWM_M1PWM2, PWM_M1PWM3, PWM_M1PWM4, PWM_M1PWM5, PWM_M1PWM6, PWM_M1PWM7};
enum {PWM_DB_FALLING, PWM_DB_RISING};
enum {PWM_COUNT_DOWN, PWM_COUNT_UP_DOWN, PWM_ACT_NOTHING, PWM_ACT_INVERT, PWM_ACT_LOW, PWM_ACT_HIGH};
enum {PWM_EVENT_ZERO = 0, PWM_EVENT_LOAD = 2, PWM_EVENT_CMP_UP = 4, PWM_EVENT_CMP_DOWN = 8};
enum {PWM_CLK_DIV_2, PWM_CLK_DIV_4, PWM_CLK_DIV_8, PWM_CLK_DIV_16, PWM_CLK_DIV_32, PWM_CLK_DIV_64, PWM_CLK_DIV_1 = 0xff};

static const uint8_t pwm_pin_num_list[MICROPY_HW_MAX_PWM][2] = 
{
    {1,     0xff},  // 0xff to indicate no alternative pin
    {4,     0xff},
    {58,    0xff},
    {57,    0xff},
    {59,    0xff},
    {60,    0xff},
    {16,    61},
    {15,    62},

    {61,    0xff},
    {62,    0xff},
    {23,    59},
    {24,    60},
    {28,    0xff},
    {29,    0xff},
    {30,    0xff},
    {31,    0xff},
};

typedef struct _machine_pwm_obj_t
{
    mp_obj_base_t       base;
    const pin_obj_t*    pin;            // output pin for pwm, can be NULL (None)
    uint8_t             id;             // id 0..15 for pwm generator
    uint8_t             id_mod;         // pwm module number
    uint8_t             id_gen;         // pwm generator number

    bool                mode;           // pwm count mode
    bool                active;         // pwm output active
    bool                invert;         // invert pwm output
    uint32_t            freq;           // pwm frequency
    uint16_t            load;           // internal pwm load value
    uint8_t             duty;           // pwm duty cycle 0..100
    mp_obj_t            irq;            // interrupt isr
    uint32_t            db_falling;     // deadband delay for falling edge
    uint32_t            db_rising;      // deadband delay for rising edge
    const pin_obj_t*    fault_pin;      // pin to assert fault condition, can be NULL (None)

} machine_pwm_obj_t;

static machine_pwm_obj_t machine_pwm_obj[MICROPY_HW_MAX_PWM] = {};
static bool machine_pwm_obj_in_use[MICROPY_HW_MAX_PWM] = {};
static uint8_t machine_pwm_clock_divider_value = PWM_CLK_DIV_1;

void delay_cycles(uint16_t n)
{
    for (uint16_t i = 0; i < n; i++)
        asm("nop");
}

uint8_t pwm_get_id_from_pin(const pin_obj_t* pin, bool alternate_pin)
{
    for (uint8_t i = 0; i < MICROPY_HW_MAX_PWM; i++)
    {
        if (pwm_pin_num_list[i][alternate_pin] == pin->pin_num)
            return i;
    }
    return 0xff;
}

uint8_t pwm_get_port_index_from_pin(const pin_obj_t* pin)
{
    return (uint8_t) qstr_str(pin->name)[1] - (uint8_t) 'A';
}

uint8_t pwm_get_pin_index_from_pin(const pin_obj_t* pin)
{
    return (uint8_t) qstr_str(pin->name)[2] - (uint8_t) '0';
}

uint32_t pwm_get_pwm_base_reg(machine_pwm_obj_t* self)
{
    return (self->id_mod ? PWM1_BASE: PWM0_BASE);
}

void pwm_set_clock(uint8_t id_mod, bool val)
{
    if (val)
    {
        HWREG(SYSCTL_RCGCPWM) |= 1 << id_mod;
        // ensure pwm is ready
        delay_cycles(3);
    }
    else
        HWREG(SYSCTL_RCGCPWM) &= ~(1 << id_mod);
}

void pwm_set_enable(machine_pwm_obj_t* self, bool val)
{
    // get register address of MxPWMxCTL
    uint32_t reg = pwm_get_pwm_base_reg(self) + PWM_O_0_CTL + self->id_gen * 0x40;
    // start timer in MxPWMxCTL
    if (val)
        HWREG(reg) |= 1;
    else
        HWREG(reg) &= ~1;
}

void pwm_set_sync(machine_pwm_obj_t* self, bool val)
{
    // get register address of MxPWMxCTL
    uint32_t reg = pwm_get_pwm_base_reg(self) + PWM_O_0_CTL + self->id_gen * 0x40;
    // set global sync in MxPWMxCTL
    if (val)
        HWREG(reg) |= 0xfff8;
    // set immediate sync in MxPWMxCTL
    else
        HWREG(reg) &= ~0xfff8;
}

void pwm_set_gpio(machine_pwm_obj_t* self, bool val)
{
    // abort if no pin assigned
    if (!self->pin)
        return;
    // uint32_t gpio_port_base_map[] = {GPIO_PORTA_BASE, GPIO_PORTB_BASE, GPIO_PORTC_BASE, GPIO_PORTD_BASE, GPIO_PORTE_BASE, GPIO_PORTF_BASE};
    uint32_t gpio_port_base_map[] = {GPIO_PORTA_AHB_BASE, GPIO_PORTB_AHB_BASE, GPIO_PORTC_AHB_BASE, GPIO_PORTD_AHB_BASE, GPIO_PORTE_AHB_BASE, GPIO_PORTF_AHB_BASE};
    
    uint8_t port_index = pwm_get_port_index_from_pin(self->pin);
    uint8_t pin_index = pwm_get_pin_index_from_pin(self->pin);
    uint8_t pctl_val = (self->id < PWM_M1PWM0 ? 4: 5);
    if (val)
    {
        // enable clock for gpio module
        HWREG(SYSCTL_RCGCGPIO) |= 1 << port_index;
        delay_cycles(3);

