mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/pwm.c
        // unlock gpio
        HWREG(gpio_port_base_map[port_index] + GPIO_O_LOCK) = GPIO_LOCK_KEY;
        HWREG(gpio_port_base_map[port_index] + GPIO_O_CR) |= 1 << pin_index;
        
        // enable alternate pin function
        HWREG(gpio_port_base_map[port_index] + GPIO_O_AFSEL) |= 1 << pin_index;
        HWREG(gpio_port_base_map[port_index] + GPIO_O_PCTL) |= pctl_val << (4 * pin_index);
    }
    else
    {
        // disable alternate pin function
        HWREG(gpio_port_base_map[port_index] + GPIO_O_PCTL) &= ~(pctl_val << (4 * pin_index));
        HWREG(gpio_port_base_map[port_index] + GPIO_O_AFSEL) &= ~(1 << pin_index);
    }
}

void pwm_set_mode(machine_pwm_obj_t* self, bool val)
{
    // get register address of MxPWMxCTL
    uint32_t reg = pwm_get_pwm_base_reg(self) + PWM_O_0_CTL + self->id_gen * 0x40;
    // set mode in MxPWMxCTL
    if (val)
        HWREG(reg) |= 1 << 1;
    else
        HWREG(reg) &= ~(1 << 1);
    
    // get offset for register address MxPWMxGENx
    uint8_t reg_offset = (self->id % 2 ? PWM_O_0_GENB: PWM_O_0_GENA);
    // get register address of MxPWMxGENx
    reg = pwm_get_pwm_base_reg(self) + reg_offset + self->id_gen * 0x40;
    HWREG(reg) &= ~0xfff;
    HWREG(reg) |= PWM_ACT_HIGH << PWM_EVENT_LOAD | PWM_ACT_LOW << (PWM_EVENT_CMP_DOWN + 4*(self->id % 2));
}

void pwm_clear_counter(machine_pwm_obj_t* self)
{
    // get register address of PWMxCOUNT
    uint32_t reg = pwm_get_pwm_base_reg(self) + PWM_O_0_COUNT + self->id_gen * 0x40;
    // clear counter value
    HWREG(reg) &= 0xffff0000;
}

void pwm_update_active(machine_pwm_obj_t* self, bool val)
{
    // get register address of MxPWMENABLE
    uint32_t reg = pwm_get_pwm_base_reg(self) + PWM_O_ENABLE;
    // enable pin output in MxPWMENABLE
    if (val)
        HWREG(reg) |= 1 << (self->id % PWM_M1PWM0);
    else
        HWREG(reg) &= ~(1 << (self->id % PWM_M1PWM0));
    self->active = val;
}

void pwm_update_invert(machine_pwm_obj_t* self, bool val)
{
    // get register address of MxPWMINVERT
    uint32_t reg = pwm_get_pwm_base_reg(self) + PWM_O_INVERT;
    if (val)
        HWREG(reg) |= 1 << (self->id % PWM_M1PWM0);

    self->invert = val;
}

void pwm_update_clock_divider(uint8_t val)
{
    if (val > PWM_CLK_DIV_64 && val != PWM_CLK_DIV_1)
        mp_raise_ValueError(MP_ERROR_TEXT("Value out of range"));
    
    // change requested
    if (val != machine_pwm_clock_divider_value)
    {
        pwm_set_clock(0, 0);
        pwm_set_clock(1, 0);
        // disable divider
        if (val == PWM_CLK_DIV_1)
            HWREG(SYSCTL_RCC) &= ~(1<<20);
        // set divider
        else
        {
            uint32_t write_val = val << 17;
            // enable divider
            if (machine_pwm_clock_divider_value == PWM_CLK_DIV_1)
                write_val |= 1<<20;
            // clear and set divider
            HWREG(SYSCTL_RCC) &= ~(0x0f < 17);
            HWREG(SYSCTL_RCC) |= write_val;
        }
        machine_pwm_clock_divider_value = val;
        pwm_set_clock(0, 1);
        pwm_set_clock(1, 1);
    }
}

void pwm_update_freq(machine_pwm_obj_t* self, uint32_t val)
{
    uint32_t sys_freq = SysCtlClockGet();
    uint32_t pwm_freq = (machine_pwm_clock_divider_value != PWM_CLK_DIV_1 ? sys_freq / 2<<(machine_pwm_clock_divider_value + 1) : sys_freq);

    if (val > pwm_freq / 10)
        mp_raise_ValueError(MP_ERROR_TEXT("Value out of range, must be <= sys_clk / pwm_div / 10"));
    
    // get register address of MxPWMxLOAD
    uint32_t reg = pwm_get_pwm_base_reg(self) + PWM_O_0_LOAD + self->id_gen * 0x40;
    // get second pwm of generator
    machine_pwm_obj_t* twin = &machine_pwm_obj[(self->id % 2 ? self->id - 1: self->id + 1)];
    // if twin pwm is active dont allow different frequency
    if (twin->freq && val != twin->freq)
        mp_raise_ValueError(MP_ERROR_TEXT("Frequency must be the same inside one PWM generator"));
    
    uint16_t load_val = pwm_freq / val;
    HWREG(reg) &= ~0xffff;
    HWREG(reg) |= load_val;

    pwm_clear_counter(self);
    self->load = load_val;
    self->freq = val;
}

void pwm_update_duty(machine_pwm_obj_t* self, uint8_t val)
{
    if (val > 100)
        mp_raise_ValueError(MP_ERROR_TEXT("Value out of range"));

    // get offset for register address MxPWMxCMPx
    uint8_t reg_offset = (self->id % 2 ? PWM_O_0_CMPB: PWM_O_0_CMPA);
    // get register address of MxPWMxCMPx
    uint32_t reg = pwm_get_pwm_base_reg(self) + reg_offset + self->id_gen * 0x40;

    uint16_t comp_val = 0;
    if (self->mode)
        ;
    else
        comp_val = self->load - val * self->load / 100;
    HWREG(reg) &= ~0xffff;
    HWREG(reg) |= comp_val;
    self->duty = val;
}

void pwm_update_sync(machine_pwm_obj_t* self, const machine_pwm_obj_t* tbs, uint8_t n_tbs)
{
    if (n_tbs)
    {

    }
    else
    ;
}

void pwm_update_irq(machine_pwm_obj_t* self, mp_obj_t irq)
{

}

void pwm_update_db(machine_pwm_obj_t* self, uint32_t db, uint8_t db_type)
{
    switch (db_type)
    {
    case PWM_DB_FALLING:    self->db_falling = db;  break;
    case PWM_DB_RISING:     self->db_rising = db;   break;
    
    default: mp_raise_ValueError(MP_ERROR_TEXT("Deadband type out of range"));   break;
    }
}

void pwm_update_fault(machine_pwm_obj_t* self, bool val)
{

}

void pwm_init(machine_pwm_obj_t* self, const pin_obj_t* pin, int mode, bool active, bool invert, uint32_t freq, uint8_t duty, uint32_t db_falling, uint32_t db_rising, mp_obj_t irq, mp_obj_t fault)
{
    pwm_set_clock(self->id_mod, 1);
    pwm_set_enable(self, 0);
    pwm_update_active(self, 0);
    if (pin)
        self->pin = pin;
    pwm_set_gpio(self, 1);
    pwm_set_mode(self, mode);
    // pwm_set_sync(self, 1);
    pwm_update_freq(self, freq);
    pwm_update_duty(self, duty);

    pwm_update_invert(self, invert);
    pwm_update_db(self, db_falling, PWM_DB_FALLING);
    pwm_update_db(self, db_rising, PWM_DB_RISING);
    pwm_update_irq(self, irq);
    pwm_update_fault(self, fault);

    pwm_set_enable(self, 1);
    pwm_update_active(self, 1);
}

void pwm_deinit(machine_pwm_obj_t* self)
{
    pwm_update_active(self, 0);
    pwm_set_enable(self, 0);
    if (self->pin)
        pwm_set_gpio(self, 0);
    self->freq = 0;
    machine_pwm_obj_in_use[self->id] = false;
}

// ##### internal PWM functions #####

// enable pwm module

// enable gpio module
// enable alternate functions
// assign pwm to gpio

// set pwm clock divider
// set count mode
// 


// ##### helper functions #####
mp_obj_t machine_pwm_init_helper(machine_pwm_obj_t* self, size_t n_args, const mp_obj_t* pos_args, mp_map_t* kw_args, const pin_obj_t* pin)
{
    enum {ARG_pin, ARG_active, ARG_invert, ARG_mode, ARG_freq, ARG_duty, ARG_db_falling, ARG_db_rising, ARG_irq, ARG_fault};
    static const mp_arg_t allowed_args[] = 
    {
        {MP_QSTR_pin,           MP_ARG_KW_ONLY | MP_ARG_OBJ,    {.u_obj = mp_const_none}},
        {MP_QSTR_active,        MP_ARG_KW_ONLY | MP_ARG_BOOL,   {.u_int = true}},
        {MP_QSTR_invert,        MP_ARG_KW_ONLY | MP_ARG_BOOL,   {.u_int = false}},
        {MP_QSTR_mode,          MP_ARG_KW_ONLY | MP_ARG_BOOL,   {.u_int = PWM_COUNT_DOWN}},
        {MP_QSTR_freq,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0}},
        {MP_QSTR_duty,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0}},
        {MP_QSTR_db_falling,    MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0}},
        {MP_QSTR_db_rising,     MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0}},
        {MP_QSTR_irq,           MP_ARG_KW_ONLY | MP_ARG_OBJ,    {.u_obj = mp_const_none}},
        {MP_QSTR_fault,         MP_ARG_KW_ONLY | MP_ARG_OBJ,    {.u_obj = mp_const_none}},
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // get arguments
    if (!pin)               // dont overwrite if created via pin
        pin =               (args[ARG_pin].u_obj == mp_const_none ? NULL: args[ARG_pin].u_obj);
    bool mode =             args[ARG_mode].u_int;
    bool active =           args[ARG_active].u_int;
    bool invert =           args[ARG_invert].u_int;
    uint32_t freq =         args[ARG_freq].u_int;
    uint8_t duty =          args[ARG_duty].u_int;
    uint32_t db_falling =   args[ARG_db_falling].u_int;
    uint32_t db_rising =    args[ARG_db_rising].u_int;
    mp_obj_t irq =          args[ARG_irq].u_obj;
    mp_obj_t fault =        args[ARG_fault].u_obj;

    pwm_init(self, pin, mode, active, invert, freq, duty, db_falling, db_rising, irq, fault);
    
    return self;
}

mp_obj_t machine_pwm_deinit_helper(machine_pwm_obj_t* self)
{
    pwm_deinit(self);
    return mp_const_none;
}

mp_obj_t machine_pwm_active_helper(machine_pwm_obj_t* self, size_t n_args, const mp_obj_t* pos_args)
{
    if (n_args)
    {
        if (mp_obj_is_bool(pos_args[0]) || mp_obj_is_int(pos_args[0]))
            pwm_update_active(self, MP_OBJ_SMALL_INT_VALUE(pos_args[0]));
        else
            mp_raise_ValueError(MP_ERROR_TEXT("Type mismatch: not an int"));
    }
    return mp_obj_new_bool(self->active);
}

